# Challenge 4: Baby Names

### Scenario
You are a data analyst and you have been tasked with summarizing data about the occurrence of baby names. Your manager would like the following questions answered.

In [1]:
# import libraries/packages
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
# get dataset
data = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
data.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

In [4]:
# know dataset
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### 1. See the first 10 entries.

In [6]:
# first ten entries of dataset
entries = data.head(10)
entries

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### 2. Delete the columns ‘Unnamed: 0’ and ‘Id’.

In [14]:
# delete colums 'Unnamed: 0' and 'Id'
new_data = data.drop(['Unnamed: 0', 'Id'], axis=1)
new_data.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### 3. Group the dataset by name, assign to a variable called names, and sort the dataset by highest to lowest count.

In [23]:
# create a variable called names and assign it with data groupby name
names = new_data.groupby('Name')['Count'].size().sort_values(ascending=False)
names.head()

Name
Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Name: Count, dtype: int64

### 4. How many different names exist in the dataset?

In [32]:
# different names in the dataset
dif_names = new_data.Name.nunique()
print('Number of different names in the dataset is',dif_names)

Number of different names in the dataset is 17632

### 5. What is the name with most occurrences?

In [37]:
# most occurring name
modal_name = new_data.Name.value_counts()
print('The name with most occurrences is',modal_name.idxmax())

The name with most occurrences is Riley

### 6. What is the standard deviation of count of names?

In [40]:
# standard deviation of Count of Names
standard_deviation = new_data.Count.std()
print('The standard deviation of count of names is', round(standard_deviation, 2))

The standard deviation of count of names is 97.4

### 7. Get a summary of the dataset with the mean, min, max, std and quartiles.

In [43]:
# summary of the dataset
new_data.describe()

               Year         Count
count  1.016395e+06  1.016395e+06
mean   2.009053e+03  3.485012e+01
std    3.138293e+00  9.739735e+01
min    2.004000e+03  5.000000e+00
25%    2.006000e+03  7.000000e+00
50%    2.009000e+03  1.100000e+01
75%    2.012000e+03  2.600000e+01
max    2.014000e+03  4.167000e+03

Challenge 4 completed!!!